<template>
  <div class="bl-notes">
    <div class="container">
      <div class="row">
        <Note
          v-for="item in list"
          :key="item.id"
          :data-note="item"
        />
      </div>
    </div>
    <div class="btn-add-note">
      <img src="/images/plus.svg" alt="add-note" />
    </div>
  </div>
</template>

<script>

import Note from '@components/Note.vue'
export default {
  components: {
    Note
  },
  data() {
    return {
      list: [
        {
          id: 0,
          title: 'Заголовок',
          text: 'А также явные признаки победы институционализации могут быть объединены в целые кластеры себе подобных.'
        },
        {
          id: 1,
          title: 'Заголовок1',
          text: 'Не следует, однако, забывать, что базовый вектор развития предопределяет высокую востребованность позиций, занимаемых участниками в отношении поставленных задач. Вот вам яркий пример современных тенденций — повышение уровня гражданского сознания требует анализа переосмысления внешнеэкономических политик.'
        },
        {
          id: 2,
          title: 'Заголовок2',
          text: 'А также явные признаки победы институционализации могут быть объединены в целые кластеры себе подобных.'
        },
        {
          id: 3,
          title: 'Заголовок3',
          text: 'А также явные признаки победы институционализации могут быть объединены в целые кластеры себе подобных.'
        },
        {
          id: 4,
          title: 'Заголовок4',
          text: 'А также явные признаки победы институционализации могут быть объединены в целые кластеры себе подобных.'
        }
      ]
    }
  }
}
</script>
